Table of Contents
 Enum BoltShearType
Namespace
IdeaRS.OpenModel.Parameters
Assembly
IdeaRS.OpenModel.dll
Defines a transfer of shear force in bolts.
public enum BoltShearType
Fields
Bearing = 0
Not used. Recomendation use value Interaction
Friction = 2
TODO DRA 3
Interaction = 1
TODO DRA 2
Fields
 Name |  Description
 Bearing = 0
Not used. Recomendation use value Interaction
 Friction = 2
TODO DRA 3
 Interaction = 1
TODO DRA 2
 Edit this page